// lab11_1.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//
#include <iostream>
using namespace std;
	void main()
	{
		setlocale(LC_CTYPE, "Russian");
		char tmp[33];
		int A, B, maskA = 14;
		int maskB = ~maskA >> 1;
		cout << "Первое число А="; cin >> A;
		cout << "Второе число В="; cin >> B;
		_itoa_s(A, tmp, 2);
		cout << "A=" << tmp << endl;
		_itoa_s(B, tmp, 2);
		cout << "B=" << tmp << endl;
		_itoa_s(maskA, tmp, 2);
		cout << "Маска для А: " << tmp << endl;
		_itoa_s((A & maskA) >> 1, tmp, 2);
		cout << "Выделенные биты А: " << tmp << endl;
		_itoa_s(maskB, tmp, 2);
		cout << "Маска для В: " << tmp << endl;
		_itoa_s(B & maskB, tmp, 2);
		cout << " Очищены биты в B: " << tmp << endl;
		_itoa_s(((B & maskB) | ((A & maskA) >> 1)), tmp, 2);
		cout << " Результат B=" << tmp << endl;
	}

    

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
