// lab8.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//
#include <iostream>
using namespace std;
int getSum(int x, int y);
int getMul(int x, int y);

int main(int argc, char* argv[])
{
    int parm1 = 5;
    for (int i = 0; i < 5; i++)
    {
        int parm2 = parm1 + i;
        int result_getSum = getSum(parm1, parm2);
        cout << "i=" << i;
        cout << "getSum(" << parm1 << "," << parm2 << ") =" << result_getSum << endl;
    }
    int result_getMul = getMul(2, 3);
    cout << result_getMul << endl;
    system("pause");
    return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
