USE  UNIVER;
GO
INSERT INTO STUDENT(IDGROUP, NAME, BDAY, INFO)
VALUES(4, 'нАНДНБ о.ю', '2003-07-03',
	'<ярсдемр>
		<оюяонпр яепхъ="цп" мнлеп="4133033" дюрю="2013-04-19" />
		<рекетнм>+375291247723</рекетнм>
		<юдпея>
			<ярпюмю>аекюпсяэ</ярпюмю>
			<цнпнд>лХМЯЙ</цнпнд>
			<скхжю>дГЕПФХМЯЙНЦН</скхжю>
			<днл>11</днл>
			<йбюпрхпю>142</йбюпрхпю>
		</юдпея>
	</ярсдемр>');
GO
SELECT * FROM STUDENT WHERE NAME = 'нАНДНБ о.ю'
GO
UPDATE STUDENT SET INFO = 
	'<ярсдемр>
		<оюяонпр яепхъ="цп" мнлеп="4133033" дюрю="19.04.2013" />
		<рекетнм>+375291234567</рекетнм>
		<юдпея>
			<ярпюмю>аекюпсяэ</ярпюмю>
			<цнпнд>лНЦХКЕБ</цнпнд>
			<скхжю>кЕМХМЮ</скхжю>
			<днл>10</днл>
			<йбюпрхпю>10</йбюпрхпю>
		</юдпея>
	</ярсдемр>' WHERE NAME='йнпемвсй ю.б.'; 
GO
SELECT NAME[тхн], INFO.value('(ярсдемр/оюяонпр/@яепхъ)[1]', 'CHAR(2)')[яепхъ оюяонпрю],
	INFO.value('(ярсдемр/оюяонпр/@мнлеп)[1]', 'VARCHAR(20)')[мнлеп оюяонпрю],
	INFO.query('/ярсдемр/юдпея')[юдпея]
		FROM  STUDENT
			WHERE NAME = 'нАНДНБ о.ю';  

